# 設定ファイル(config.py)###############
version = 'v2' # プログラムバージョン
channel = 24 # 周波数チャンネル　！！！ch24-38は簡易無線局要申請！！！
pwr = 13  #20mw->13
######################################

# 周波数リスト(チャンネル:周波数)
# https://www.tele.soumu.go.jp/j/adm/system/ml/920mhz/index.htm (最終確認20231016)
# ch24-38は簡易無線局である為要申請
frequency_list = {
    # 簡易無線局(要申請)
    24:920.6,
    25:920.8,
    26:921.0,
    27:921.2,
    28:921.4,
    29:921.6,
    30:921.8,
    31:922.0,
    32:922.2,
    33:922.4,
    34:922.6,
    35:922.8,
    36:923.0,
    37:923.2,
    38:923.4,
    # 特定省電力無線曲
    39:923.6,
    40:923.8,
    41:924.0,
    42:924.2,
    43:924.4,
    44:924.6,
    45:924.8,
    46:925.0,
    47:925.2,
    48:925.4,
    49:925.6,
    50:925.8,
    51:926.0,
    52:926.2,
    53:926.4,
    54:926.6,
    55:926.8,
    56:927.0,
    57:927.2,
    58:927.4,
    59:927.6,
    60:927.8,
    61:928.0,
}


#HEX_DATA = f'j314trp+{version}+{serial}-{number}'.encode('utf-8').hex()
frequency = frequency_list[channel]
